# G2M Case Study
## Data Glacier Virtual Internship
### May 12, 2024

### Overview 
XYZ is a private firm in US. Due to remarkable growth in the taxi and cab industry in last few years and multiple key players in the market, it is planning for an investment in cab industry and as per their Go-to-Market(G2M) strategy they want to understand the market before taking final decision.

### Objective 
Perform exploratory data analysis (EDA) on the given data set. Provide 5-7 hypotheses to test with data-driven results. Provide recommendations to the company after analysis.

### Data

The data provided was collected between January 31, 2016 to December 31, 2018.

### Set Up
We need to download and read the data

In [6]:
import pandas as pd

# URLs for the files
cab_data_url = "https://raw.githubusercontent.com/paulsoriiiano/G2M-Case-Study/main/data/Cab_Data.csv"
customer_url = "https://raw.githubusercontent.com/paulsoriiiano/G2M-Case-Study/main/data/Customer_ID.csv"
transaction_url = "https://raw.githubusercontent.com/paulsoriiiano/G2M-Case-Study/main/data/Transaction_ID.csv"
city_url = "https://raw.githubusercontent.com/paulsoriiiano/G2M-Case-Study/main/data/City.csv" 

# Read .csv files into a dataframe
cabs = pd.read_csv(cab_data_url)
customers = pd.read_csv(customer_url)
transactions = pd.read_csv(transaction_url)
cities = pd.read_csv(city_url)

In [8]:
cabs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  int64
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(2), object(2)
memory usage: 19.2+ MB

In [16]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49171 entries, 0 to 49170
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         49171 non-null  int64
 1   Gender              49171 non-null  object
 2   Age                 49171 non-null  int64
 3   Income (USD/Month)  49171 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [17]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440098 entries, 0 to 440097
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  440098 non-null  int64
 1   Customer ID     440098 non-null  int64
 2   Payment_Mode    440098 non-null  object
dtypes: int64(2), object(1)
memory usage: 10.1+ MB

In [18]:
cities.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     object
 2   Users       20 non-null     object
dtypes: object(3)
memory usage: 608.0+ bytes

In [19]:
cities.head(5)

             City   Population      Users
0     NEW YORK NY   8,405,837    302,149
1      CHICAGO IL   1,955,130    164,468
2  LOS ANGELES CA   1,595,037    144,132
3        MIAMI FL   1,339,155     17,675
4  SILICON VALLEY   1,177,609     27,247

In [20]:
cabs.head(5)

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,42377,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,42375,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,42371,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,42376,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,42372,Pink Cab,ATLANTA GA,8.73,114.62,97.776

In [21]:
transactions.head(5)

   Transaction ID  Customer ID Payment_Mode
0        10000011        29290         Card
1        10000012        27703         Card
2        10000013        28712         Cash
3        10000014        28020         Cash
4        10000015        27182         Card

In [22]:
customers.head(5)

   Customer ID Gender  Age  Income (USD/Month)
0        29290   Male   28               10813
1        27703   Male   27                9237
2        28712   Male   53               11242
3        28020   Male   23               23327
4        27182   Male   33                8536

In [30]:
cabs.groupby('City')['Transaction ID'].count().sort_values(ascending=False)

City
NEW YORK NY       99885
CHICAGO IL        56625
LOS ANGELES CA    48033
WASHINGTON DC     43737
BOSTON MA         29692
SAN DIEGO CA      20488
SILICON VALLEY     8519
SEATTLE WA         7997
ATLANTA GA         7557
DALLAS TX          7017
MIAMI FL           6454
AUSTIN TX          4896
ORANGE COUNTY      3982
DENVER CO          3825
NASHVILLE TN       3010
SACRAMENTO CA      2367
PHOENIX AZ         2064
TUCSON AZ          1931
PITTSBURGH PA      1313
Name: Transaction ID, dtype: int64

In [31]:
cabs.groupby('City')['Cost of Trip'].mean().sort_values(ascending=False)

City
WASHINGTON DC     294.346518
CHICAGO IL        290.578457
NEW YORK NY       290.248851
BOSTON MA         289.338413
DALLAS TX         286.974012
ATLANTA GA        282.891205
MIAMI FL          282.279820
SEATTLE WA        281.309417
LOS ANGELES CA    278.640013
DENVER CO         278.417386
SILICON VALLEY    277.896100
AUSTIN TX         275.825465
ORANGE COUNTY     275.708522
TUCSON AZ         275.670411
PHOENIX AZ        273.130697
SACRAMENTO CA     272.195082
PITTSBURGH PA     272.180261
SAN DIEGO CA      270.852066
NASHVILLE TN      268.962097
Name: Cost of Trip, dtype: float64